patrykSilkowski/nRF52_mash/app/main.c
    const otNetifAddress *uniAddress
        = otIp6GetUnicastAddresses(thread_ot_instance_get());

    if(uniAddress)
    {
        for(; uniAddress/*->mNext*/; uniAddress=uniAddress->mNext)
        {
            format_ip6(buff,&(uniAddress->mAddress));
            NRF_LOG_INFO("Unicast Address: %s", nrf_log_push(buff));
            NRF_LOG_PROCESS();
        }
    }
}


/**@brief Callback function for initializing the joiner state.
 */
static void joiner_callback(otError aError, void *aContext)
{
    switch (aError)
    {
        case OT_ERROR_NONE:
            NRF_LOG_INFO("Joiner: success - network found");

            aError = otThreadSetEnabled(thread_ot_instance_get(), true);
            ASSERT(aError == OT_ERROR_NONE);  // TODO is this a good idea?

            uint32_t err_code = app_sched_event_put(NULL, 0, sched_print_ip);
            APP_ERROR_CHECK(err_code);
        break;

        case OT_ERROR_SECURITY:
            NRF_LOG_ERROR("Joiner: failed - credentials");
        break;

        case OT_ERROR_NOT_FOUND:
            NRF_LOG_ERROR("Joiner: failed - no network");
        break;

        case OT_ERROR_RESPONSE_TIMEOUT:
            NRF_LOG_ERROR("Joiner: failed - timeout");
        break;

        case OT_ERROR_INVALID_STATE:
            NRF_LOG_ERROR("Joiner: failed - invalid state");
        break;

        default:
        break;
    }

    if (aError != OT_ERROR_NONE)
    {
        m_ot_join_tries--;

        if (m_ot_join_tries > 0)
        {
            uint32_t err_code = app_sched_event_put(NULL, 0, sched_joiner);
            APP_ERROR_CHECK(err_code);

            NRF_LOG_INFO("Trying to join the network once again, tries left:%d",
                         m_ot_join_tries - 1);
        }
        else
        {
            NRF_LOG_ERROR("Commissioning failed!\r\nRebooting the device!");
            NRF_LOG_FLUSH();
            NVIC_SystemReset(); // reboot
        }
    }
}


/**@brief Function for initializing the joiner state.
 */
static void joiner_start(void * p_context)
{
    otError ret = otJoinerStart(thread_ot_instance_get(),
                                JOINER_PSKD,
                                NULL,
                                VENDOR_NAME,
                                VENDOR_MODEL,
                                VENDOR_SW_VER,
                                VENDOR_DATA,
                                joiner_callback,
                                p_context);

    switch(ret)
    {
        case OT_ERROR_NONE:
            NRF_LOG_INFO("Joiner: enabled");
        break;

        case OT_ERROR_INVALID_ARGS:
            NRF_LOG_ERROR("Joiner: failed - aPSKd or a ProvisioningUrl is invalid.");
        break;

        case OT_ERROR_DISABLED_FEATURE:
            NRF_LOG_ERROR("Joiner: disabled");
        break;

        default:
        break;
    }
}


/**@brief Function for checking the commissioning status. Triggers the joiner
 * status if the device is not already commissioned.
 */
static void commission_check(void)
{
    if (!otDatasetIsCommissioned(thread_ot_instance_get()))
    {
        NRF_LOG_INFO("Device is not commissioned yet!");

        print_commissioning_info();
        m_ot_join_tries = OT_JOIN_TRIES; // TODO find more elegant way
        app_sched_event_put(NULL, 0, sched_joiner);
    }
    else
    {
        NRF_LOG_INFO("Device successfully commissioned!");
        app_sched_event_put(NULL, 0, sched_print_ip);
    }

    NRF_LOG_PROCESS();
}


static void thread_detach_and_commission(void)
{
    // ask for commissioning to other network
    if (OT_ERROR_NONE == otThreadBecomeDetached(thread_ot_instance_get()))
    {
        commission_check();
    }
    else
    {
        // we've got a serious problem, reboot
        NVIC_SystemReset();
    }
}


/***************************************************************************************************
 * @section MQTT-SN
 **************************************************************************************************/

/*
 * Most of MQTT-SN services is handled by comm_manager module
 * Passing callbacks to corresponding events
 */

static int8_t gateway_search_callback(mqttsn_event_t * p_event)
{
    int8_t ret = CONN_MGR_SUCCESS;

    switch (p_event->event_data.discovery)
    {
        case MQTTSN_SEARCH_GATEWAY_FINISHED:
            //gateway already discovered
        break;

        case MQTTSN_SEARCH_GATEWAY_TRANSPORT_FAILED:
            ret = (int8_t) app_sched_event_put(NULL,
                                               0,
                                               sched_ot_recommissioning);
        break;

        case MQTTSN_SEARCH_GATEWAY_PLATFORM_FAILED:
            // we've got a serious problem, reboot
            NVIC_SystemReset();
        break;

        case MQTTSN_SEARCH_GATEWAY_NO_GATEWAY_FOUND:
            ret = (int8_t) app_sched_event_put(NULL,
                                               0,
                                               sched_ot_recommissioning);
        break;

        default:
            ret = -1;
        break;
    } // end of switch

    return ret;
}


static int8_t gateway_found_callback(mqttsn_event_t * p_event)
{
    /**
     * Just schedule the connection after the successful search
     */
    return (int8_t) app_sched_event_put(NULL,
                                        0,
                                        sched_mqttsn_gw_connect);
}


static int8_t connected_to_gateway_callback(mqttsn_event_t * p_event)
{
    /**
     * Just schedule the service creator startup
     */
    return (int8_t) app_sched_event_put(NULL,
                                        0,
                                        sched_start_services);
}


static int8_t register_acknowledge_callback(mqttsn_event_t * p_event)
{
    /**
     * Just schedule the register service handler
     */
    return (int8_t) app_sched_event_put(p_event,
                                        sizeof(mqttsn_event_t *),
                                        sched_registed_service);
}


static int8_t subscription_acknowledge_callback(mqttsn_event_t * p_event)
{
    /**
     * Just schedule the subscript service handler
     */
    return (int8_t) app_sched_event_put(p_event,
                                        sizeof(mqttsn_event_t *),
                                        sched_subscribed_service);
}


static int8_t message_timeout_callback(mqttsn_event_t * p_event)
{
    return (int8_t) app_sched_event_put(p_event,
                                        sizeof(mqttsn_event_t *),
                                        sched_timeout_handler);
}


static void mqttsn_init(void)
{
    comm_manager_set_evt_gateway_search_timeout_cb(gateway_search_callback);
    comm_manager_set_evt_gateway_found_cb(gateway_found_callback);
    comm_manager_set_evt_connected_cb(connected_to_gateway_callback);
    comm_manager_set_evt_registered_cb(register_acknowledge_callback);
    comm_manager_set_evt_subscribed_cb(subscription_acknowledge_callback);
    comm_manager_set_evt_timeout_cb(message_timeout_callback);


    comm_manager_mqttsn_init(thread_ot_instance_get());
}


/***************************************************************************************************
 * @section State
 **************************************************************************************************/

static void publish(void)
{
    //char* pub_data = g_led_2_on ? "1" : "0";
    /*
    uint32_t err_code = mqttsn_client_publish(&m_client, m_topic_pub.topic_id,
        (uint8_t*)pub_data, strlen(pub_data), &m_msg_id);
    if (err_code != NRF_SUCCESS)
    {
        NRF_LOG_ERROR("PUBLISH message could not be sent. Error code: 0x%x\r\n", err_code)
    }
    else
    {
        NRF_LOG_INFO("PUBLISH successfully sent.");
    }
    */
}

static void bsp_event_handler(bsp_event_t event)
{
    if (otThreadGetDeviceRole(thread_ot_instance_get()) < OT_DEVICE_ROLE_CHILD)
    {
        (void)event;
        return;
    }
    
