patrykSilkowski/nRF52_mash/app/main.c
        case MQTTSN_PACKET_PUBACK:
            NRF_LOG_ERROR("PUBACK message has not been received!");
        break;

        case MQTTSN_PACKET_SUBACK:
            NRF_LOG_ERROR("SUBACK message has not been received!");

            err_code = service_retry_subscribe(p_evt->event_data.error.msg_id);
        break;

        case MQTTSN_PACKET_UNSUBACK:
            NRF_LOG_ERROR("UNSUBACK message has not been received!");
        break;

        case MQTTSN_PACKET_PINGREQ:
            NRF_LOG_ERROR("PINGREQ message has not been received!");
        break;

        case MQTTSN_PACKET_WILLTOPICUPD:
            NRF_LOG_ERROR("WILLTOPICUPD message has not been received!");
        break;

        case MQTTSN_PACKET_WILLMSGUPD:
            NRF_LOG_ERROR("WILLMSGUPD message has not been received!");
        break;

        default:
        case MQTTSN_PACKET_INCORRECT:
            NRF_LOG_ERROR("Unknown error!");
        break;
    } // end of switch (msg_type)

    NRF_LOG_ERROR("Timeout handling returned with error %d", err_code);

    if (SERVICE_RETRY_CNT_MAX_FLAG == err_code)
    {
        // TODO this should be reconsidered!
        comm_manager_disconnect_from_gateway();
        comm_manager_search_gateway();
    }
}


/***************************************************************************************************
 * @section Main
 **************************************************************************************************/

int main(int argc, char *argv[])
{
    log_init();
    scheduler_init();
    timer_init();
    leds_init();
    buttons_bsp_init();

/*
 *  mash_id_gen();
    NRF_LOG_INFO("ID:%s",mash_get_id());
 */

    thread_instance_init();
    //init_joiner_timer();
    commission_check();
    mqttsn_init();
    //start_joiner_timer();

    while (true)
    {
        thread_process();
        app_sched_execute();

        if (NRF_LOG_PROCESS() == false)
        {
            thread_sleep();
        }
    }
}

/**
 *@}
 **/
